# Import Pandas

In [1]:
import pandas as pd

# Create and view a series of three different colours

In [2]:
colors=pd.Series(["red","green","blue"])
colors

0      red
1    green
2     blue
dtype: object

# Create a series of three different car types and view it

In [3]:
car=pd.Series(["suv","convertible","sedan"])
car

0            suv
1    convertible
2          sedan
dtype: object

# Combine the Series of cars and colours into a DataFrame

In [4]:
combine = pd.DataFrame({
    "cat_type":car,
    "color":colors
})
combine

      cat_type  color
0          suv    red
1  convertible  green
2        sedan   blue

# Import "../data/car-sales.csv" and turn it into a DataFrame

In [5]:
car_sales=pd.read_csv("data/car-sales.csv")
car_df=pd.DataFrame(car_sales)
car

0            suv
1    convertible
2          sedan
dtype: object

# Find the different datatypes of the car

In [6]:
car_df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

# Describe your current car DataFrame using describe()

In [7]:
car_df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

# Get information about your DataFrame using info()

In [8]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

# Create a Series of different numbers and find the mean of them

In [9]:
number_series=pd.Series([1,2,3,4,5])
number_series.mean()

np.float64(3.0)

# Create a Series of different numbers and find the sum of them

In [10]:
series = pd.Series([1,2,3,4,5])
series.sum()

np.int64(15)

# List out all the column names of the car_df DataFrame

In [15]:
car_df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

# Find the length of the car_df DataFrame

In [16]:
len(car_df)

10

# Show the first 5 rows of the car_df DataFrame

In [24]:
car_df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

# Show the first 7 rows of the car_df DataFrame

In [20]:
car_df.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

# Show the bottom 5 rows of the car_df DataFrame

In [25]:
car_df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

# Use .loc to select the row at index 3 of the car_df DataFrame

In [28]:
#loc is label based(uses index and columns)
car_df.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

# Use .iloc to select the row at position 3 of the car_df DataFrame

In [31]:
#iloc is index based(0-based indexing)
car_df.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object